import styles from './ServicePage.module.css'
import Header from "../../components/Layout/Header/Header.tsx";
import Footer from "../../components/Layout/Footer/Footer.tsx";

export const ServicePage = () => {
	return (
		<div className={styles.container}>
			<Header/>
			<div className={styles.wrapper}>
				<div className={styles.information}>
					<div className={styles.serviceInformationBlock}>
						<div className={styles.cardImg}>
							<svg xmlns="http://www.w3.org/2000/svg" width="37" height="38" viewBox="0 0 37 38" fill="none">
								<path
									d="M18.3333 11.4684C18.3333 9.16644 20.1988 7.30037 22.5 7.30037C24.8012 7.30037 26.6667 9.16644 26.6667 11.4684C26.6667 13.7703 24.8012 15.6363 22.5 15.6363C20.1988 15.6363 18.3333 13.7703 18.3333 11.4684Z"
									fill="#C8C8C8"/>
								<path fill-rule="evenodd" clip-rule="evenodd" d="M14.9271 0.631592C12.6553 0.631579 10.8486 0.631568 9.39096 0.7507C7.8983 0.872695 6.62551 1.12788 5.4601 1.72187C3.57847 2.68091 2.04867 4.2112 1.08994 6.09342C0.496129 7.2592 0.241027 8.53239 0.119071 10.0255C-2.37549e-05 11.4836 -1.30311e-05 13.2909 2.80597e-07 15.5634V22.3781C-1.30311e-05 24.6505 -2.37549e-05 26.4578 0.119071 27.9159C0.241027 29.4091 0.496129 30.6823 1.08994 31.848C2.04867 33.7303 3.57847 35.2605 5.4601 36.2196C6.62551 36.8136 7.8983 37.0688 9.39096 37.1908C10.8486 37.3099 12.6552 37.3099 14.9269 37.3099H21.7396C24.0113 37.3099 25.8181 37.3099 27.2757 37.1908C28.7684 37.0688 30.0412 36.8136 31.2066 36.2196C33.0882 35.2605 34.618 33.7303 35.5767 31.848C36.1705 30.6823 36.4256 29.4091 36.5476 27.9159C36.6667 26.4579 36.6667 24.6506 36.6667 22.3783V15.5633C36.6667 13.291 36.6667 11.4836 36.5476 10.0255C36.4256 8.53239 36.1705 7.2592 35.5767 6.09342C34.618 4.2112 33.0882 2.68091 31.2066 1.72187C30.0412 1.12788 28.7684 0.872695 27.2757 0.7507C25.8181 0.631568 24.0113 0.631579 21.7396 0.631592H14.9271ZM6.9734 4.69283C7.59058 4.37826 8.37587 4.17916 9.6624 4.07402C10.9684 3.96728 12.6389 3.96598 15 3.96598H21.6667C24.0277 3.96598 25.6983 3.96728 27.0043 4.07402C28.2908 4.17916 29.0761 4.37826 29.6933 4.69283C30.9477 5.33219 31.9676 6.35239 32.6067 7.6072C32.9212 8.22458 33.1202 9.01011 33.2253 10.2971C33.332 11.6035 33.3333 13.2745 33.3333 15.6363V22.3051C33.3333 22.9027 33.3333 23.456 33.3314 23.9704L30.6904 21.3285C29.3886 20.0263 27.2781 20.0263 25.9763 21.3285L22.2559 25.0501C21.9305 25.3756 21.4028 25.3756 21.0774 25.0501L10.6904 14.6597C9.38861 13.3576 7.27806 13.3576 5.97631 14.6597L3.33333 17.3035V15.6363C3.33333 13.2745 3.33463 11.6035 3.44133 10.2971C3.54645 9.01011 3.74549 8.22458 4.05996 7.6072C4.69911 6.35239 5.71898 5.33219 6.9734 4.69283Z" fill="#C8C8C8"/>
							</svg>
							<div className={styles.rating}>
								<div className={styles.cardStarsNumber}>
									<img src="../../../public/star.svg" alt="star"/>
									5.0
								</div>
								<div className={styles.cardRatingNumber}>35 відгуків</div>
							</div>
						</div>
						<div className={styles.serviceInformation}>
							<div className={styles.serviceTitle}>Перукарня “Тетяна”</div>
							<div className={styles.serviceAddress}>вул. Прикарпатська 35, ТЦ “Карпати” с.Марківка</div>
							<div className={styles.serviceDescription}>The standard chunk of Lorem Ipsum used since the
								1500s is reproduced below for those interested. Sections 1.10.32 and 1.10.33 from "de
								Finibus Bonorum et Malorum" by Cicero are also reproduced in their exact original form,
								accompanied by English versions from the 1914 translation by H. Rackham.
							</div>
						</div>
						<div className={styles.options}>
							<div className={styles.optionsTitle}>
								<div className={styles.title}>Послуги</div>
								<div className={styles.search}>Пошук</div>
							</div>
							<div className={styles.optionBlock}>
								<div className={styles.option}>Стрижка жіноча</div>
								<div className={styles.optionActions}>
									<div>
										<div className={styles.optionPrice}>350,0 грн</div>
										<div className={styles.optionTime}>30 хв</div>
									</div>
									<div className={styles.optionButton}>Забронювати</div>
								</div>
							</div>
							<div className={styles.optionBlock}>
								<div className={styles.option}>Стрижка жіноча</div>
								<div className={styles.optionActions}>
									<div>
										<div className={styles.optionPrice}>350,0 грн</div>
										<div className={styles.optionTime}>30 хв</div>
									</div>
									<div className={styles.optionButton}>Забронювати</div>
								</div>
							</div>
							<div className={styles.optionBlock}>
								<div className={styles.option}>Стрижка жіноча</div>
								<div className={styles.optionActions}>
									<div>
										<div className={styles.optionPrice}>350,0 грн</div>
										<div className={styles.optionTime}>30 хв</div>
									</div>
									<div className={styles.optionButton}>Забронювати</div>
								</div>
							</div>
							<div className={styles.optionBlock}>
								<div className={styles.option}>Стрижка жіноча</div>
								<div className={styles.optionActions}>
									<div>
										<div className={styles.optionPrice}>350,0 грн</div>
										<div className={styles.optionTime}>30 хв</div>
									</div>
									<div className={styles.optionButton}>Забронювати</div>
								</div>
							</div>
						</div>

						<div className={styles.ourWorksBlock}>
							<div className={styles.ourWorksTitle}>Наші роботи</div>
							<div className={styles.ourWorksPortfolio}>
								<div className={styles.mainImg}>
									<svg xmlns="http://www.w3.org/2000/svg" width="37" height="38" viewBox="0 0 37 38" fill="none">
										<path
											d="M18.3333 11.4684C18.3333 9.16644 20.1988 7.30037 22.5 7.30037C24.8012 7.30037 26.6667 9.16644 26.6667 11.4684C26.6667 13.7703 24.8012 15.6363 22.5 15.6363C20.1988 15.6363 18.3333 13.7703 18.3333 11.4684Z"
											fill="#C8C8C8"/>
										<path fill-rule="evenodd" clip-rule="evenodd" d="M14.9271 0.631592C12.6553 0.631579 10.8486 0.631568 9.39096 0.7507C7.8983 0.872695 6.62551 1.12788 5.4601 1.72187C3.57847 2.68091 2.04867 4.2112 1.08994 6.09342C0.496129 7.2592 0.241027 8.53239 0.119071 10.0255C-2.37549e-05 11.4836 -1.30311e-05 13.2909 2.80597e-07 15.5634V22.3781C-1.30311e-05 24.6505 -2.37549e-05 26.4578 0.119071 27.9159C0.241027 29.4091 0.496129 30.6823 1.08994 31.848C2.04867 33.7303 3.57847 35.2605 5.4601 36.2196C6.62551 36.8136 7.8983 37.0688 9.39096 37.1908C10.8486 37.3099 12.6552 37.3099 14.9269 37.3099H21.7396C24.0113 37.3099 25.8181 37.3099 27.2757 37.1908C28.7684 37.0688 30.0412 36.8136 31.2066 36.2196C33.0882 35.2605 34.618 33.7303 35.5767 31.848C36.1705 30.6823 36.4256 29.4091 36.5476 27.9159C36.6667 26.4579 36.6667 24.6506 36.6667 22.3783V15.5633C36.6667 13.291 36.6667 11.4836 36.5476 10.0255C36.4256 8.53239 36.1705 7.2592 35.5767 6.09342C34.618 4.2112 33.0882 2.68091 31.2066 1.72187C30.0412 1.12788 28.7684 0.872695 27.2757 0.7507C25.8181 0.631568 24.0113 0.631579 21.7396 0.631592H14.9271ZM6.9734 4.69283C7.59058 4.37826 8.37587 4.17916 9.6624 4.07402C10.9684 3.96728 12.6389 3.96598 15 3.96598H21.6667C24.0277 3.96598 25.6983 3.96728 27.0043 4.07402C28.2908 4.17916 29.0761 4.37826 29.6933 4.69283C30.9477 5.33219 31.9676 6.35239 32.6067 7.6072C32.9212 8.22458 33.1202 9.01011 33.2253 10.2971C33.332 11.6035 33.3333 13.2745 33.3333 15.6363V22.3051C33.3333 22.9027 33.3333 23.456 33.3314 23.9704L30.6904 21.3285C29.3886 20.0263 27.2781 20.0263 25.9763 21.3285L22.2559 25.0501C21.9305 25.3756 21.4028 25.3756 21.0774 25.0501L10.6904 14.6597C9.38861 13.3576 7.27806 13.3576 5.97631 14.6597L3.33333 17.3035V15.6363C3.33333 13.2745 3.33463 11.6035 3.44133 10.2971C3.54645 9.01011 3.74549 8.22458 4.05996 7.6072C4.69911 6.35239 5.71898 5.33219 6.9734 4.69283Z" fill="#C8C8C8"/>
									</svg>
								</div>
								<div className={styles.secondaryImages}>
									<div className={styles.ourWorksImg}>
										<svg xmlns="http://www.w3.org/2000/svg" width="37" height="38" viewBox="0 0 37 38" fill="none">
											<path
												d="M18.3333 11.4684C18.3333 9.16644 20.1988 7.30037 22.5 7.30037C24.8012 7.30037 26.6667 9.16644 26.6667 11.4684C26.6667 13.7703 24.8012 15.6363 22.5 15.6363C20.1988 15.6363 18.3333 13.7703 18.3333 11.4684Z"
												fill="#C8C8C8"/>
											<path fill-rule="evenodd" clip-rule="evenodd" d="M14.9271 0.631592C12.6553 0.631579 10.8486 0.631568 9.39096 0.7507C7.8983 0.872695 6.62551 1.12788 5.4601 1.72187C3.57847 2.68091 2.04867 4.2112 1.08994 6.09342C0.496129 7.2592 0.241027 8.53239 0.119071 10.0255C-2.37549e-05 11.4836 -1.30311e-05 13.2909 2.80597e-07 15.5634V22.3781C-1.30311e-05 24.6505 -2.37549e-05 26.4578 0.119071 27.9159C0.241027 29.4091 0.496129 30.6823 1.08994 31.848C2.04867 33.7303 3.57847 35.2605 5.4601 36.2196C6.62551 36.8136 7.8983 37.0688 9.39096 37.1908C10.8486 37.3099 12.6552 37.3099 14.9269 37.3099H21.7396C24.0113 37.3099 25.8181 37.3099 27.2757 37.1908C28.7684 37.0688 30.0412 36.8136 31.2066 36.2196C33.0882 35.2605 34.618 33.7303 35.5767 31.848C36.1705 30.6823 36.4256 29.4091 36.5476 27.9159C36.6667 26.4579 36.6667 24.6506 36.6667 22.3783V15.5633C36.6667 13.291 36.6667 11.4836 36.5476 10.0255C36.4256 8.53239 36.1705 7.2592 35.5767 6.09342C34.618 4.2112 33.0882 2.68091 31.2066 1.72187C30.0412 1.12788 28.7684 0.872695 27.2757 0.7507C25.8181 0.631568 24.0113 0.631579 21.7396 0.631592H14.9271ZM6.9734 4.69283C7.59058 4.37826 8.37587 4.17916 9.6624 4.07402C10.9684 3.96728 12.6389 3.96598 15 3.96598H21.6667C24.0277 3.96598 25.6983 3.96728 27.0043 4.07402C28.2908 4.17916 29.0761 4.37826 29.6933 4.69283C30.9477 5.33219 31.9676 6.35239 32.6067 7.6072C32.9212 8.22458 33.1202 9.01011 33.2253 10.2971C33.332 11.6035 33.3333 13.2745 33.3333 15.6363V22.3051C33.3333 22.9027 33.3333 23.456 33.3314 23.9704L30.6904 21.3285C29.3886 20.0263 27.2781 20.0263 25.9763 21.3285L22.2559 25.0501C21.9305 25.3756 21.4028 25.3756 21.0774 25.0501L10.6904 14.6597C9.38861 13.3576 7.27806 13.3576 5.97631 14.6597L3.33333 17.3035V15.6363C3.33333 13.2745 3.33463 11.6035 3.44133 10.2971C3.54645 9.01011 3.74549 8.22458 4.05996 7.6072C4.69911 6.35239 5.71898 5.33219 6.9734 4.69283Z" fill="#C8C8C8"/>
										</svg>
									</div>
									<div className={styles.ourWorksImg}>
										<svg xmlns="http://www.w3.org/2000/svg" width="37" height="38" viewBox="0 0 37 38" fill="none">
											<path
												d="M18.3333 11.4684C18.3333 9.16644 20.1988 7.30037 22.5 7.30037C24.8012 7.30037 26.6667 9.16644 26.6667 11.4684C26.6667 13.7703 24.8012 15.6363 22.5 15.6363C20.1988 15.6363 18.3333 13.7703 18.3333 11.4684Z"
												fill="#C8C8C8"/>
											<path fill-rule="evenodd" clip-rule="evenodd" d="M14.9271 0.631592C12.6553 0.631579 10.8486 0.631568 9.39096 0.7507C7.8983 0.872695 6.62551 1.12788 5.4601 1.72187C3.57847 2.68091 2.04867 4.2112 1.08994 6.09342C0.496129 7.2592 0.241027 8.53239 0.119071 10.0255C-2.37549e-05 11.4836 -1.30311e-05 13.2909 2.80597e-07 15.5634V22.3781C-1.30311e-05 24.6505 -2.37549e-05 26.4578 0.119071 27.9159C0.241027 29.4091 0.496129 30.6823 1.08994 31.848C2.04867 33.7303 3.57847 35.2605 5.4601 36.2196C6.62551 36.8136 7.8983 37.0688 9.39096 37.1908C10.8486 37.3099 12.6552 37.3099 14.9269 37.3099H21.7396C24.0113 37.3099 25.8181 37.3099 27.2757 37.1908C28.7684 37.0688 30.0412 36.8136 31.2066 36.2196C33.0882 35.2605 34.618 33.7303 35.5767 31.848C36.1705 30.6823 36.4256 29.4091 36.5476 27.9159C36.6667 26.4579 36.6667 24.6506 36.6667 22.3783V15.5633C36.6667 13.291 36.6667 11.4836 36.5476 10.0255C36.4256 8.53239 36.1705 7.2592 35.5767 6.09342C34.618 4.2112 33.0882 2.68091 31.2066 1.72187C30.0412 1.12788 28.7684 0.872695 27.2757 0.7507C25.8181 0.631568 24.0113 0.631579 21.7396 0.631592H14.9271ZM6.9734 4.69283C7.59058 4.37826 8.37587 4.17916 9.6624 4.07402C10.9684 3.96728 12.6389 3.96598 15 3.96598H21.6667C24.0277 3.96598 25.6983 3.96728 27.0043 4.07402C28.2908 4.17916 29.0761 4.37826 29.6933 4.69283C30.9477 5.33219 31.9676 6.35239 32.6067 7.6072C32.9212 8.22458 33.1202 9.01011 33.2253 10.2971C33.332 11.6035 33.3333 13.2745 33.3333 15.6363V22.3051C33.3333 22.9027 33.3333 23.456 33.3314 23.9704L30.6904 21.3285C29.3886 20.0263 27.2781 20.0263 25.9763 21.3285L22.2559 25.0501C21.9305 25.3756 21.4028 25.3756 21.0774 25.0501L10.6904 14.6597C9.38861 13.3576 7.27806 13.3576 5.97631 14.6597L3.33333 17.3035V15.6363C3.33333 13.2745 3.33463 11.6035 3.44133 10.2971C3.54645 9.01011 3.74549 8.22458 4.05996 7.6072C4.69911 6.35239 5.71898 5.33219 6.9734 4.69283Z" fill="#C8C8C8"/>
										</svg>
									</div>
									<div className={styles.ourWorksImg}>
										<svg xmlns="http://www.w3.org/2000/svg" width="37" height="38" viewBox="0 0 37 38" fill="none">
											<path
												d="M18.3333 11.4684C18.3333 9.16644 20.1988 7.30037 22.5 7.30037C24.8012 7.30037 26.6667 9.16644 26.6667 11.4684C26.6667 13.7703 24.8012 15.6363 22.5 15.6363C20.1988 15.6363 18.3333 13.7703 18.3333 11.4684Z"
												fill="#C8C8C8"/>
											<path fill-rule="evenodd" clip-rule="evenodd" d="M14.9271 0.631592C12.6553 0.631579 10.8486 0.631568 9.39096 0.7507C7.8983 0.872695 6.62551 1.12788 5.4601 1.72187C3.57847 2.68091 2.04867 4.2112 1.08994 6.09342C0.496129 7.2592 0.241027 8.53239 0.119071 10.0255C-2.37549e-05 11.4836 -1.30311e-05 13.2909 2.80597e-07 15.5634V22.3781C-1.30311e-05 24.6505 -2.37549e-05 26.4578 0.119071 27.9159C0.241027 29.4091 0.496129 30.6823 1.08994 31.848C2.04867 33.7303 3.57847 35.2605 5.4601 36.2196C6.62551 36.8136 7.8983 37.0688 9.39096 37.1908C10.8486 37.3099 12.6552 37.3099 14.9269 37.3099H21.7396C24.0113 37.3099 25.8181 37.3099 27.2757 37.1908C28.7684 37.0688 30.0412 36.8136 31.2066 36.2196C33.0882 35.2605 34.618 33.7303 35.5767 31.848C36.1705 30.6823 36.4256 29.4091 36.5476 27.9159C36.6667 26.4579 36.6667 24.6506 36.6667 22.3783V15.5633C36.6667 13.291 36.6667 11.4836 36.5476 10.0255C36.4256 8.53239 36.1705 7.2592 35.5767 6.09342C34.618 4.2112 33.0882 2.68091 31.2066 1.72187C30.0412 1.12788 28.7684 0.872695 27.2757 0.7507C25.8181 0.631568 24.0113 0.631579 21.7396 0.631592H14.9271ZM6.9734 4.69283C7.59058 4.37826 8.37587 4.17916 9.6624 4.07402C10.9684 3.96728 12.6389 3.96598 15 3.96598H21.6667C24.0277 3.96598 25.6983 3.96728 27.0043 4.07402C28.2908 4.17916 29.0761 4.37826 29.6933 4.69283C30.9477 5.33219 31.9676 6.35239 32.6067 7.6072C32.9212 8.22458 33.1202 9.01011 33.2253 10.2971C33.332 11.6035 33.3333 13.2745 33.3333 15.6363V22.3051C33.3333 22.9027 33.3333 23.456 33.3314 23.9704L30.6904 21.3285C29.3886 20.0263 27.2781 20.0263 25.9763 21.3285L22.2559 25.0501C21.9305 25.3756 21.4028 25.3756 21.0774 25.0501L10.6904 14.6597C9.38861 13.3576 7.27806 13.3576 5.97631 14.6597L3.33333 17.3035V15.6363C3.33333 13.2745 3.33463 11.6035 3.44133 10.2971C3.54645 9.01011 3.74549 8.22458 4.05996 7.6072C4.69911 6.35239 5.71898 5.33219 6.9734 4.69283Z" fill="#C8C8C8"/>
										</svg>
									</div>
								</div>
							</div>
						</div>
						<div className={styles.reviewsBlock}>
							<div className={styles.reviewsTitle}>Відгуки</div>
							<div className={styles.review}>
								<div className={styles.stars}>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
								</div>
								<div className={styles.reviewServiceName}>Стрижка жіноча</div>
								<div className={styles.reviewClientName}>Спеціаліст Іванка</div>
								<div className={styles.reviewDescription}>Йой, то була сама лучша стрижка в моєму житті. На роботі подружки обзавідувались, а Галька прям почервоніла від злости!</div>
								<div className={styles.reviewButton}>Комент</div>
							</div>
							<div className={styles.review}>
								<div className={styles.stars}>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
								</div>
								<div className={styles.reviewServiceName}>Стрижка жіноча</div>
								<div className={styles.reviewClientName}>Спеціаліст Іванка</div>
								<div className={styles.reviewDescription}>Йой, то була сама лучша стрижка в моєму житті. На роботі подружки обзавідувались, а Галька прям почервоніла від злости!</div>
								<div className={styles.reviewButton}>Комент</div>
							</div>
							<div className={styles.review}>
								<div className={styles.stars}>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
									<div className={styles.star}>
										<svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
											<path
												d="M12 17.77L18.18 21.5L16.54 14.47L22 9.74L14.81 9.13L12 2.5L9.19 9.13L2 9.74L7.46 14.47L5.82 21.5L12 17.77Z"
												fill="#1C1B1F"/>
										</svg>
									</div>
								</div>
								<div className={styles.reviewServiceName}>Стрижка жіноча</div>
								<div className={styles.reviewClientName}>Спеціаліст Іванка</div>
								<div className={styles.reviewDescription}>Йой, то була сама лучша стрижка в моєму житті. На роботі подружки обзавідувались, а Галька прям почервоніла від злости!</div>
								<div className={styles.reviewButton}>Комент</div>
							</div>

						</div>




					</div>
					<div className={styles.contacts}>
						<div className={styles.contactsBlock}>
							<div className={styles.map}>
								<svg xmlns="http://www.w3.org/2000/svg" width="48" height="48" viewBox="0 0 48 48" fill="none">
									<path
										d="M22.8103 0.869997C19.024 1.31812 15.4984 3.02599 12.7997 5.71923C10.101 8.41246 8.38602 11.9347 7.93026 15.72C7.29026 21.36 10.5903 25.92 13.1903 30.01L18.7903 38.15L24.7903 46.82L30.7903 38.15L36.4503 29.91C38.8903 26.29 41.7203 22.5 41.7203 17.68C41.7213 15.2894 41.2158 12.9258 40.237 10.7448C39.2582 8.56384 37.8284 6.61502 36.0417 5.02677C34.2551 3.43852 32.1521 2.24689 29.8715 1.5304C27.5908 0.813918 25.1842 0.588839 22.8103 0.869997ZM24.7403 23.79C23.1244 23.79 21.5448 23.3108 20.2013 22.4131C18.8577 21.5154 17.8105 20.2394 17.1922 18.7465C16.5738 17.2536 16.412 15.6109 16.7272 14.0261C17.0425 12.4413 17.8206 10.9855 18.9632 9.84293C20.1058 8.70034 21.5616 7.92222 23.1464 7.60698C24.7312 7.29174 26.3739 7.45353 27.8668 8.0719C29.3597 8.69027 30.6356 9.73744 31.5334 11.081C32.4311 12.4245 32.9103 14.0041 32.9103 15.62C32.9103 17.7868 32.0495 19.8649 30.5173 21.3971C28.9852 22.9292 26.9071 23.79 24.7403 23.79Z"
										fill="#010101"/>
								</svg>
							</div>
							<div className={styles.phoneBlock}>
								<div className={styles.phone}><img src='../../../public/phone.svg' alt='phone'/>+38 050
									955
									63 81
								</div>
								<div className={styles.buttonPhone}>Зателефонувати</div>
							</div>
							<div className={styles.workingDaysBlock}>
								<div className={styles.workingDay}>
									<div className={styles.day}>Понеділок</div>
									<div className={styles.time}>8:00 - 20:00</div>
								</div>
								<div className={styles.workingDay}>
									<div className={styles.day}>Вівторок</div>
									<div className={styles.time}>8:00 - 20:00</div>
								</div>
								<div className={styles.workingDay}>
									<div className={styles.day}>Середа</div>
									<div className={styles.time}>8:00 - 20:00</div>
								</div>
								<div className={styles.workingDay}>
									<div className={styles.day}>Четвер</div>
									<div className={styles.time}>8:00 - 20:00</div>
								</div>
								<div className={styles.workingDay}>
									<div className={styles.day}>П’ятниця</div>
									<div className={styles.time}>8:00 - 20:00</div>
								</div>
								<div className={styles.workingDay}>
									<div className={styles.day}>Субота</div>
									<div className={styles.time}>8:00 - 20:00</div>
								</div>
								<div className={styles.workingDay}>
									<div className={styles.day}>Неділя</div>
									<div className={styles.time}>Зачинено</div>
								</div>
							</div>
							<div className={styles.socials}>Ми в соцмережах</div>
							<div className={styles.sendReview}>Залишити відгук</div>
						</div>
					</div>
				</div>
			</div>
			<Footer/>
		</div>
	)
}